#snake case-არის ძალიან კარგი პრაკტიკა რადგან მრავალ სიტყვიან ცვლადებს გამოვყოფთ (_)და ამით უფრო მარტივი გასარჩევია ცვლადები

num1= input("ჩაწერი რიცხვი: ")
num2 = input("ჩაწერე მეორე რიცხვი: ")
print("ჯამი:", num1 + num2)                                               #იმიტო არ დაიბეჭდა სასურველი რიცხვი რომ ამას კომპიუტერი string ათ აღიქვამს და არა ცალკე რიცხვად
                                                                      # ამის მოგვარება შეგვიძლის ფრჩხილების მოხსნით
                                                                          