number = 5  # დადგენილი რიცხვი, რომელიც მომხმარებელმა უნდა გამოცნოს
attempt = 3  # მომხმარებლის მიერ რიცხვის გამოცნობის მცდელობების რაოდენობა
user_input = ""  # პირველი შეყვანა ცარიელი, მნიშვნელობა მოგვიანებით აიღება

# while ციკლი მუშაობს სანამ მომხმარებლის შეყვანა არ დაემთხვევა დადგენილ რიცხვს და სანამ მცდელობები არ ამოიწურება
while user_input != number and attempt > 0:
    user_input = int(input("Guess the number between 1-10: "))  # მომხმარებლისგან მიღება და რიცხვის ფორმატში გადაყვანა
    attempt -= 1  # ყოველი მცდელობის შემდეგ მცდელობების რაოდენობის შემცირება
    
    if user_input == number:  # თუ მომხმარებელმა სწორად გამოიცნო რიცხვი
        print("You win!")  # თამაშის მოგება
    elif attempt == 0:  # თუ მცდელობები ამოწურულია და რიცხვი არ შეესაბამება
        print("You lose!")  # თამაშის წაგება
    else:  # თუ რიცხვი არასწორია და მცდელობები დარჩა
        print("Wrong number!")  # არასწორი პასუხის შეტყობინება
        print("You still have " + str(attempt) + " tries")  # დარჩენილი მცდელობების რაოდენობის ჩვენება
