#int- ფუნქცია რომელსაც ბრჩხილებში გადაეცემა string რიცხვები
num1=int(input("ჩაწერე შენი საყვარელი რიცხვი: "))
num2=int(input("ჩაწერე შენი საყვარელი მეორე რიცხვი"))
num3=int(input("ჩაწერე ნებისმიერი რიცხვი"))
num4=int(input("ჩაწერე ნებისმიერუ რიცხვი"))
num5=int(input("ჩაწერე 1 დან 10 ამდე რიცხვი"))
jami=(num1 + num2 + num3 + num4 + num5)
print(jami)

#integer- ეს მონაცემი წარმოადგენს მთელ რიცხვებს
# int1= 10
# int2= 15
# int3=5

#float- წარმოადგენს ათწილად რიცხვებს
# float1=5,3
# float2=10,4
# float3=3,5

#string - წარმოადგენს  ტექსტურ მონაცემს
#string1="5"
#string2="6"
#string3="1"