# 1) შექმენით 5 ელემენტიანი სახელების სია და სლაისინგის გამოყენებით დაბეჭდეთ პირველი ინდექსიდან მესამე ინდექსამდე ყველა ელემენტი
# 2) დაბეჭდე იგივე სია შემობრუნებულად
# 3) შექმენი 10 ელემენტიანი რიცხვების სია და დაბეჭდეთ ყოველი მეორე ელემენტი
# 4) იგივე სიიდან დაბეჭდე 3 ინდექსიდან მეშვიდე ინდექსის ჩათვლით ყველა ელემენტი
# 5) იგივე სიიდან დაბეჭდე მეორე ინდექსიდან -2 ინდექსამდე ყოველი მეორე ელემენტი
# 6) შემოაბრუნე სია და ყოველი მეორე ელემენტი დაბეჭდე

num=[1,2,3,4,5,6,7,8,9,10]
print(num[0:5])
print(num[::-1])
print(num[::2])
print(num[3:8:])
print(num[2:-2])
print(num[::-2])